{
    "home": {
        "heroSection": {
            "titlePart1": "Transform your images into",
            "titlePart2": "Vector Art",
            "description": "Convert images to SVG vector format in seconds, without quality loss and completely free!",
            "blockTitle1": "Drag and drop your image here",
            "blockTitle2": "or click to select a file",
            "blockButton": "Select Image",
            "tip": "Learn how it works"
        },
        "howItWorksSection": {
            "titlePart1": "How",
            "titlePart2": "It Works",
            "description": "Turning your images into vectors has never been so simple and fast. Just three steps, and you'll have your vector art ready.",
            "cardTitle1": "Upload your image",
            "cardDescription1": "Drag and drop or select any image from your device. Supports JPG, JPEG and PNG",
            "cardTitle2": "Choose the conversion type",
            "cardDescription2": "Our tool transforms your images into vector art in SVG format with professional quality.",
            "cardTitle3": "Download your SVG",
            "cardDescription3": "Get your SVG file ready to be used in designs, websites, or print."
        },
        "gallerySection": {
            "titlePart1": "Gallery of ",
            "titlePart2": "Examples",
            "description": "See the power of our vectorization tool through these before and after examples.",
            "cardTitle1": "Business Logo",
            "cardDescription1": "Corporate logo vectorized with sharp lines.",
            "cardTitle2": "Simple Icon",
            "cardDescription2": "Vectorized icon, keeping the design clear and precise.",
            "cardTitle3": "Creative Image",
            "cardDescription3": "Vector transformation of an image with a focus on artistic style and customized details."
        },
        "faqSection": {
            "titlePart1": "Frequently",
            "titlePart2": "Asked Questions",
            "description": "Find answers to the most common questions about our vectorization tool.",
            "question1": "What is vector art?",
            "answer1": "Vector art is a type of digital graphic that uses mathematical formulas to render images. Unlike bitmap (raster) images, which are made of pixels, vector art uses mathematical paths, meaning it can be scaled infinitely without losing quality.",
            "question2": "What types of images can I vectorize?",
            "answer2": "You can vectorize almost any image, but the best results are obtained with images that have clear lines and well-defined contrasts. Logos, icons, illustrations, and simple drawings work very well. Complex photographs can be vectorized, but the result may be more stylized.",
            "question3": "In what formats can I download my vectorized art?",
            "answer3": "We currently offer downloads in SVG (Scalable Vector Graphics) format, which is widely compatible with design software such as Adobe Illustrator, Figma, Inkscape, and others. You can also use the SVG directly on websites.",
            "question4": "Is the service really free?",
            "answer4": "Yes! The vectorization service is completely free, with no watermarks or limitations on the downloaded images.",
            "question5": "How can I edit the SVG file after downloading it?",
            "answer5": "You can edit the SVG file in any vector design software like Adobe Illustrator, CorelDRAW, Inkscape (free), or online tools like Figma. These programs allow you to modify colors, sizes, shapes, and other aspects of your file.",
            "question6": "Are my images stored on your servers?",
            "answer6": "No. All processing is done directly in your browser, locally. Your images are never sent to our servers, ensuring complete privacy and security."
        }
    },
    "upload": {
        "noSvgBlockTitle1": "Drag and drop your image here",
        "noSvgBlockTitle2": "or click to select a file",
        "noSvgBlockButton": "Select Image",
        "button1": "SVG Color",
        "button2": "Zoom",
        "button3": "Zoom",
        "button4Opt1": "View Original",
        "button4Opt2": "View SVG",
        "button5": "New Image",
        "button6": "Donwload"
    },
    "header": {
        "option1": "How it works",
        "option2": "Gallery",
        "option3": "FAQ"
    },
    "footer": {
        "description": "Transform your logos into vector art easily and for free. Our automatic vectorization tool delivers high-quality SVGs in seconds.",
        "shorDescriptionLeft1": "Made with",
        "shorDescriptionLeft2": "in Brazil",
        "title1": "Quick Links",
        "title2": "Contact me",
        "optionId1": "Home",
        "optionId2": "How it works",
        "optionId3": "Gallery",
        "optionId4": "FAQ",
        "copyright1": "Made by",
        "copyright2": ". All rights reserved ©"
    },
    "holdImage": {
        "description": "Drop the image anywhere"
    },
    "toasts": {
        "noSvg": "No SVG to download",
        "genericError": "Error while vectorizing:",
        "invalidTypeImage": "Invalid file type. Please upload a PNG, JPG, or JPEG image."
    }
}
